### Exercise 
In this file using following columns build a model to predict if person would survive or not,<br>
Pclass<br>
Sex<br>
Age<br>
Fare<br>
Calculate score of your mode

In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
from sklearn import tree 
from sklearn.model_selection import train_test_split 
%matplotlib notebook

In [2]:
df=pd.read_csv("titanic.csv")

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
servive=df[["Pclass","Sex","Age","Fare"]]

In [5]:
servive

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [6]:
servive.isnull().count()

Pclass    891
Sex       891
Age       891
Fare      891
dtype: int64

In [7]:
servive.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  891 non-null    int64
 1   Sex     891 non-null    object
 2   Age     714 non-null    float64
 3   Fare    891 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 28.0+ KB

In [8]:
mean_age=round(servive.Age.mean())

In [9]:
mean_age

30

In [10]:
servive.fillna(value= mean_age , inplace=True)

C:\Users\Mohamed\anaconda3\lib\site-packages\pandas\core\frame.py:4317: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().fillna(

In [11]:
servive.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  891 non-null    int64
 1   Sex     891 non-null    object
 2   Age     891 non-null    float64
 3   Fare    891 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 28.0+ KB

In [12]:
servive["servive"]=df.Survived

<ipython-input-12-089bbb739a54>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  servive["servive"]=df.Survived

In [13]:
servive

     Pclass     Sex   Age     Fare  servive
0         3    male  22.0   7.2500        0
1         1  female  38.0  71.2833        1
2         3  female  26.0   7.9250        1
3         1  female  35.0  53.1000        1
4         3    male  35.0   8.0500        0
..      ...     ...   ...      ...      ...
886       2    male  27.0  13.0000        0
887       1  female  19.0  30.0000        1
888       3  female  30.0  23.4500        0
889       1    male  26.0  30.0000        1
890       3    male  32.0   7.7500        0

[891 rows x 5 columns]

In [14]:
from sklearn .preprocessing import LabelEncoder

In [15]:
tran=LabelEncoder()

In [16]:
servive["sex_n"]=tran.fit_transform(servive.Sex)

<ipython-input-16-0e56faca9477>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  servive["sex_n"]=tran.fit_transform(servive.Sex)

In [17]:
servive

     Pclass     Sex   Age     Fare  servive  sex_n
0         3    male  22.0   7.2500        0      1
1         1  female  38.0  71.2833        1      0
2         3  female  26.0   7.9250        1      0
3         1  female  35.0  53.1000        1      0
4         3    male  35.0   8.0500        0      1
..      ...     ...   ...      ...      ...    ...
886       2    male  27.0  13.0000        0      1
887       1  female  19.0  30.0000        1      0
888       3  female  30.0  23.4500        0      0
889       1    male  26.0  30.0000        1      1
890       3    male  32.0   7.7500        0      1

[891 rows x 6 columns]

In [18]:
x=servive.drop(["servive","Sex"] ,axis=1)

y=servive.servive

In [19]:
x_train ,x_test ,y_train ,y_test=train_test_split(x ,y, test_size=0.15 )

In [20]:
model =tree.DecisionTreeClassifier()

In [21]:
model.fit(x_train , y_train)

DecisionTreeClassifier()

In [22]:
model.score(x_train,y_train)

0.9801849405548216

In [23]:
model.score(x_test ,y_test)

0.7835820895522388

In [24]:
import joblib

In [25]:
 joblib.dump(model, 'Titanic Survived Prediction')

['Titanic Survived Prediction']